GT2/SRS/DES_KO_HRN/system/aposterioriFO
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cacheTemporaryObjects
(
    "kOmegaSSTDES:G"
    "(CDES*delta)"
    //"(nut+nu)"
);

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

writeObjects1
{
    type        writeObjects;
    libs        ("libutilityFunctionObjects.so");

    enabled           on;

    //writeControl     outputTime;

    //writeControl     timeStep;
   // writeInterval    1;

    writeControl     outputTime;
    writeInterval    10;

//Switch-off to save complex cacheTemporaryObjects names
    regExp  off;

    objects     
    (    
	"kOmegaSSTDES:G"
	"(CDES*delta)"
    );
}

// #includeFunc writeObjects(regExp=off, "CDES*delta")
    
///////////////////////////////////////////////////////////////////////////

}

